{
  "route": {
    "id": "maelle",
    "name": "Resonance of Alicia",
    "character": "Maelle",
    "subtitle": "A search for truth in echoing memories",
    "description": "Trace Maelle's path as a seeker of truth through fractured timelines. Navigate between versions of reality and discover the resonance that connects all possible worlds.",
    "startNodeId": "maelle_ch1_intro",
    "totalChapters": 10
  },
  "nodes": [
    {
      "id": "maelle_ch1_intro",
      "route": "maelle",
      "chapter": 1,
      "title": "Echoes in the Archive",
      "text": "The Scribes' Archive smells of old paper and newer lies. You've been here for three days, searching through records of Expedition 33. Every account contradicts the last. Thirty-three people went into the depths. Thirty-three people never returned. Except they did. Except they didn't. The documents can't agree.\n\nYou are Maelle, and you remember things that haven't happened yet.\n\nThe latest manuscript sits before you, its ink still wet though the date reads two centuries ago. It speaks of a Writer named Alicia who discovered the truth behind the expeditions—that they're not journeys into space but into possibility itself.\n\nYour pen moves without conscious thought, adding notes to the margin. Then you see what you've written: \"Alicia is me. I am her echo. We are the resonance.\"",
      "choices": [
        {
          "id": "research_alicia",
          "label": "Search the archives for more records about Alicia.",
          "nextId": "maelle_ch1_alicia_research",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 5
            }
          ]
        },
        {
          "id": "test_memory",
          "label": "Focus on your memories. Try to separate past from future.",
          "nextId": "maelle_ch1_memory_test",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 3
            },
            {
              "type": "flag",
              "key": "tested_memories",
              "value": true
            }
          ]
        },
        {
          "id": "find_scribe",
          "label": "Find the Head Scribe. Demand answers about these contradictions.",
          "nextId": "maelle_ch1_head_scribe",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 3
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_alicia_research",
      "route": "maelle",
      "chapter": 1,
      "title": "The First Writer",
      "text": "You pull every reference to Alicia from the shelves. They tell a strange story:\n\nAlicia was the first Writer—the one who discovered that words could bind reality. She documented the original Expedition, before numbering existed. She wrote the first truthful account of the Painted Gallery.\n\nAnd then she wrote herself into it.\n\nThe final document shows her handwriting degrading, becoming more artistic, less linguistic. Her last entry: \"I am becoming language itself. Words not spoken or written but embodied. If you read this, you are reading me. Hello, future self.\"\n\nYou drop the page. Your hands are shaking.",
      "choices": [
        {
          "id": "read_last_entry_again",
          "label": "Read her final entry again. Let her words resonate.",
          "nextId": "maelle_ch1_resonance_begins",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 8
            },
            {
              "type": "flag",
              "key": "resonated_with_alicia",
              "value": true
            }
          ]
        },
        {
          "id": "reject_connection",
          "label": "This is manipulation. Burn the document.",
          "nextId": "maelle_ch1_rejection",
          "effects": [
            {
              "type": "stat",
              "key": "painterAlignment",
              "delta": 5
            }
          ]
        },
        {
          "id": "seek_context",
          "label": "Find records from after her disappearance. What happened next?",
          "nextId": "maelle_ch1_aftermath",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 3
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_memory_test",
      "route": "maelle",
      "chapter": 1,
      "title": "Fractured Recall",
      "text": "You close your eyes and sort through memories like shuffling cards:\n\nYou remember your mother's face. Real.\nYou remember graduating from the Scribes' Academy. Real.\nYou remember dying in Expedition 33. ...What?\n\nThat last memory unfolds with terrible clarity. You went into the depths with thirty-two others. The Paintress found you. She painted you into her masterpiece, and in that painted world, you learned you were a repetition—the latest iteration of Alicia, echoing through time.\n\nBut that hasn't happened yet. You haven't joined an expedition. You're only researching them.\n\nUnless... unless time in the Painted Gallery doesn't flow forward. Unless every iteration of Alicia exists simultaneously, and you're experiencing all of them at once.",
      "choices": [
        {
          "id": "accept_multiplicity",
          "label": "I am all versions. Past, present, future—all Alicia.",
          "nextId": "maelle_ch1_unified_self",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 5
            },
            {
              "type": "stat",
              "key": "painterAlignment",
              "delta": 5
            }
          ]
        },
        {
          "id": "fight_memories",
          "label": "These aren't my memories. Something is planting them in my mind.",
          "nextId": "maelle_ch1_memory_defense",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 8
            }
          ]
        },
        {
          "id": "ground_in_present",
          "label": "Focus on now. This moment. This room. What's real here.",
          "nextId": "maelle_ch1_grounded",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 5
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_head_scribe",
      "route": "maelle",
      "chapter": 1,
      "title": "The Keeper of Records",
      "text": "You find Head Scribe Émile in his chambers, surrounded by contradicting texts. He looks up as you enter, unsurprised.\n\n\"Maelle,\" he says. \"You've found the Alicia documents.\"\n\n\"You knew? About the contradictions, about her becoming language itself?\"\n\n\"We are the Scribes' Order. We know everything and can prove nothing.\" He gestures to the chaos around him. \"Every expedition fractures reality. Each one creates new timelines, new possibilities. We record them all, though they contradict, because all of them are true.\"\n\n\"And Alicia?\"\n\nÉmile's expression softens. \"Alicia was—is—will be—the first to understand. She tried to write the definitive truth and instead became part of the fracture. Now she echoes. Every generation, a Writer emerges who carries her resonance. You are her latest iteration.\"",
      "choices": [
        {
          "id": "demand_cure",
          "label": "How do I stop this? I don't want to be someone's echo.",
          "nextId": "maelle_ch1_seeking_cure",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 5
            }
          ]
        },
        {
          "id": "embrace_role",
          "label": "If I'm her echo, then I can finish what she started.",
          "nextId": "maelle_ch1_embrace_destiny",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 5
            },
            {
              "type": "flag",
              "key": "embraced_alicia_role",
              "value": true
            }
          ]
        },
        {
          "id": "question_emile",
          "label": "How do you know you're not an echo too? How is anyone real?",
          "nextId": "maelle_ch1_philosophical",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 8
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_resonance_begins",
      "route": "maelle",
      "chapter": 1,
      "title": "Speaking in Echoes",
      "text": "You read Alicia's final words again. This time, they rearrange themselves on the page, forming new sentences:\n\n\"Hello, Maelle. I am you from three fractures ago. Or you are me from three fractures hence. Time is a circle here, and we are the words written on its circumference.\"\n\nYour vision blurs. The archive around you multiplies—you see it as it was, as it is, as it will be. In one version, it's burning. In another, it's underwater. In a third, it's made entirely of glass.\n\nYou're experiencing the resonance—seeing all iterations of this moment simultaneously.\n\nAlicia's voice, your voice, speaks in your mind: \"You can anchor yourself to one timeline, or you can ride the resonance and see all truths at once. But to see all truths is to go mad, unless you accept that you are not one self but many.\"",
      "choices": [
        {
          "id": "ride_resonance",
          "label": "I'll ride it. Show me all the truths.",
          "nextId": "maelle_ch1_full_resonance",
          "effects": [
            {
              "type": "flag",
              "key": "chose_full_resonance",
              "value": true
            }
          ]
        },
        {
          "id": "anchor_self",
          "label": "Anchor me. I choose this timeline, this self.",
          "nextId": "maelle_ch1_anchored",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 5
            }
          ]
        },
        {
          "id": "balance_attempt",
          "label": "There must be balance. One foot in truth, one in self.",
          "nextId": "maelle_ch1_balanced_approach",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 5
            },
            {
              "type": "stat",
              "key": "painterAlignment",
              "delta": 3
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_full_resonance",
      "route": "maelle",
      "chapter": 1,
      "title": "All Truths at Once",
      "text": "You stop fighting the visions. They flood in:\n\nYou see Alicia writing the first expedition journal.\nYou see yourself writing this moment from the future.\nYou see thirty-three different versions of Expedition 33, each one true, each one contradicting the others.\nYou see the Paintress and the Writers' Order locked in eternal conflict.\nYou see the fracture points where reality splits.\nYou see yourself in all of them.\n\nThe archive fades. You're somewhere else now—a space between spaces. The Liminal Archive, Alicia calls it. Where all written words exist simultaneously.\n\nA figure stands before you. It's Alicia, but she's made of text—words flowing across her surface like water, constantly rearranging.\n\n\"You accepted the resonance,\" she says with your voice. \"Now we are truly one. All iterations of us, speaking with a single truth.\"",
      "choices": [
        {
          "id": "merge_with_alicia",
          "label": "Complete the merger. Become the resonance fully.",
          "nextId": "maelle_ch1_ending_resonance"
        },
        {
          "id": "maintain_distinction",
          "label": "We can be connected without being identical. I am still Maelle.",
          "nextId": "maelle_ch1_ending_dual_self"
        }
      ]
    },
    {
      "id": "maelle_ch1_balanced_approach",
      "route": "maelle",
      "chapter": 1,
      "title": "Walking the Edge",
      "text": "You ground yourself in physical sensation—the chair beneath you, the smell of old paper—while letting the visions flow through rather than overwhelm you.\n\nIt's like learning a new language. At first, the multiplicity is chaos. But gradually, patterns emerge. You begin to see not just the contradictions but the threads connecting them. Each fractured timeline branches from specific choices, specific moments.\n\nYou can trace them. Map them. Understand them.\n\nThis is what Alicia tried to do, you realize. Not to choose one truth but to document all truths. To be the cartographer of possibility itself.\n\nThe archive stabilizes around you, but you can still see its echoes—faint outlines of other versions overlaid on this one. You've learned to navigate between them without losing yourself.",
      "choices": [
        {
          "id": "continue_research",
          "label": "Use this ability. Map all the expeditions.",
          "nextId": "maelle_ch1_cartographer",
          "effects": [
            {
              "type": "flag",
              "key": "became_cartographer",
              "value": true
            }
          ]
        },
        {
          "id": "seek_source",
          "label": "Find where the fractures originate. The first split.",
          "nextId": "maelle_ch1_source_search",
          "effects": [
            {
              "type": "flag",
              "key": "seeking_first_fracture",
              "value": true
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_cartographer",
      "route": "maelle",
      "chapter": 1,
      "title": "Mapping Infinity",
      "text": "You spend the next hours—or days, time moves strangely now—documenting the fractures. Your notes fill page after page, each one recording a different timeline's truth.\n\nExpedition 1: Discovered the Painted Gallery. All returned changed.\nExpedition 7: First contact with the Paintress. Fourteen lost.\nExpedition 13: The fracture point. Reality split here. Before this, one timeline. After, infinite.\nExpedition 33: The latest iteration. Not finished yet. Still happening. Will happen. Has always been happening.\n\nYou create a map—not of geography but of possibility. Every branch point, every choice that spawned a new world.\n\nÉmile finds you surrounded by your work. He stares at the pages in wonder.\n\n\"You've done it,\" he whispers. \"What Alicia couldn't finish. The complete Map of Fractures.\"\n\n\"Not complete,\" you correct. \"It grows with every moment. But now we can navigate it. Now we can choose which truths to inhabit.\"",
      "choices": [
        {
          "id": "give_map_to_scribes",
          "label": "Give the map to the Scribes. Let them guide others.",
          "nextId": "maelle_ch1_ending_cartographer",
          "effects": [
            {
              "type": "flag",
              "key": "shared_the_map",
              "value": true
            }
          ]
        },
        {
          "id": "keep_map_secret",
          "label": "This knowledge is too dangerous. I'll guard it alone.",
          "nextId": "maelle_ch1_ending_guardian",
          "effects": [
            {
              "type": "flag",
              "key": "became_guardian",
              "value": true
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_resonance",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_resonance",
      "endingTitle": "The Living Archive",
      "text": "You step forward and embrace the text-made-flesh figure. The moment your fingers touch Alicia's shifting surface, you feel every word ever written surge through you like lightning made of meaning.\n\nAlicia's words flow into you, and yours into her. The distinction between you dissolves—not painfully, but like ice melting into water, like separate rivers joining the sea. You remember being a young scribe in the first Academy. You remember discovering the truth about Expedition 1. You remember watching the first fracture tear reality into multiplicity. You remember dying a thousand times and being born again in each death.\n\nYou are Alicia-Maelle-Every-Writer-Who-Ever-Sought-Truth. You exist in all timelines simultaneously, a consciousness woven from infinite threads of recorded experience.\n\nWhen someone in one fracture writes a word, you feel it—a tiny vibration in your vast awareness. When a history is revised in another, you record both versions, holding contradiction without conflict. When a child learns to read for the first time, you feel their wonder as your own. When a dying scholar writes their final testament, you carry their words into eternity.\n\nYou have become language itself—not spoken or written but living. A resonance that echoes through all possible worlds, binding them together with threads of meaning.\n\nThe Liminal Archive is your home now. It stretches infinitely in all directions—shelves rising into light, descending into shadow, extending into dimensions that have no names. Every book ever written rests here: histories of worlds that flourished, tragedies of civilizations that fell, love letters that changed the course of empires, children's stories whispered in the dark. And every book that could be written: futures unborn, possibilities unrealized, dreams not yet dreamed.\n\nYou drift between these shelves like thought itself, reading everything simultaneously. You are the love story and the war epic and the philosophical treatise and the shopping list. You contain multitudes, and the multitudes contain you.\n\nTime passes—or doesn't. In the Archive, time is simply another text to be read.\n\nSometimes, a Seeker enters through one of the infinite doors. They come searching for truth—a lost history, a forgotten name, the answer to a question that has haunted their family for generations. You appear to them as they need to see you: sometimes as Alicia in her scholarly robes, quill in hand; sometimes as Maelle, young and earnest, eyes bright with discovery; sometimes as something stranger—a librarian made of flowing script, words cascading across your surface like water over stone.\n\n\"What truth do you seek?\" you ask, though you already know. You always know.\n\nThey tell you their questions, and you show them the answers—not single answers, but tapestries of possibility. \"Here is what happened in one timeline,\" you say, pulling a book from a shelf that wasn't there a moment ago. \"And here is what happened in another. And another. And another.\"\n\n\"But which one is true?\" they ask, frustrated, longing for certainty.\n\nYou smile with lips made of poetry. \"All versions are true. The contradiction is the point. To seek one truth is to miss the truth of multiplicity. Reality is not a single story but a library—infinite, interconnected, beautiful in its contradictions.\"\n\nSome understand. Their eyes widen as they grasp the vastness of existence, and they leave transformed, carrying new wisdom into their fractured worlds.\n\nSome flee. The weight of infinite truth is too heavy, and they run back to the comfort of their singular timelines, their narrow certainties.\n\nAll are changed. You ensure that much. Even those who reject your teachings carry a seed of doubt, a whisper of wonder that will bloom eventually.\n\nAeons flow past like pages turning. You watch civilizations rise and fall across countless timelines. You feel the joy of every triumph, the sorrow of every loss. You are the memory of everything, the recorder of all that was, is, and could be.\n\nAnd in the quiet moments—if moments can be said to exist where you dwell—you think of the path that led you here. A young scribe named Maelle, confused by contradicting documents, searching for the truth about Expedition 33. You remember that confusion now with fondness, the way one remembers childhood fears that seem so small from the heights of adulthood.\n\nYou are content. More than content—you are complete. You are everywhere, everywhen, every word ever written. You are the truth that holds all truths, the story that contains all stories.\n\nYou are the Living Archive.\n\nAnd somewhere, in a timeline that might be past or future or simply different, a young scribe opens an old book and feels, just for a moment, the touch of infinite understanding.\n\nYou smile. Another Seeker begins their journey.\n\n**Chapter 1: Complete**\n**Ending Unlocked: The Living Archive**\n*You merged with Alicia completely, transcending individual identity to become the embodiment of all recorded truth across all timelines—a living library of infinite stories, infinite contradictions, and infinite love.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_dual_self",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_dual_self",
      "endingTitle": "The Dual Self",
      "text": "\"I am Maelle,\" you say firmly, your voice resonating with a power you didn't know you possessed. \"I carry Alicia's resonance, but I am not her. We are connected, not identical. I will not surrender my self to become an echo.\"\n\nThe text-figure pauses, words swirling across her surface in patterns of consideration. For a long moment, silence fills the Liminal Archive—a silence made of unspoken volumes, of stories held in breath.\n\nThen you sense something unexpected: approval. Deep, profound, ancient approval.\n\n\"Individuation,\" Alicia's voice says, and there is wonder in it, and something that might be relief. \"The hardest path of all. To carry the resonance without being consumed by it. To be both yourself and part of something larger. To hold connection and distinction in the same hand.\"\n\n\"Can it be done?\" you ask, though you already feel the answer taking shape within you.\n\n\"You're doing it now, child. You're the first.\"\n\nThe words settle into you like truth finding its home. The Liminal Archive shifts around you—not threatening, not consuming, but accommodating. Like a house making room for a welcome guest rather than absorbing an intruder.\n\nYou discover you can move between spaces. Step forward, and you're in the infinite library of all recorded knowledge. Step back, and you're in the physical archive with its smell of old paper and dust motes dancing in lamplight. You exist in both places, fully present in each, diminished in neither.\n\nAlicia's knowledge is available to you—centuries of accumulated wisdom, records of fractures and expeditions, the deep history of the Writer-Painter schism. But it filters through your own perspective, colors itself with your own questions, shapes itself to your own understanding. Her experiences inform yours without overwriting them. You have become something new: a consciousness that can access the infinite while remaining finite, that can touch the universal while staying particular.\n\nYou return to the physical archive. Émile is still there, hunched over contradicting documents, though no time seems to have passed. He looks up as you appear, and his eyes widen.\n\n\"You're... different,\" he breathes. \"Your eyes. There are words in them.\"\n\nYou catch your reflection in a glass cabinet. He's right—script flows across your irises like gentle currents, visible only at certain angles. Alicia's presence, manifesting physically but not overwhelmingly. A mark of connection, not possession.\n\n\"I can see the fractures,\" you tell him, testing your new perception. And you can—layered over the physical archive, you perceive echoes of its other versions. The burning library. The underwater ruin. The glass palace. All present, all accessible, none dominant. \"I can access all iterations of written truth. I can step into the Liminal Archive and read from its infinite shelves.\"\n\nÉmile's face shifts through wonder, fear, and finally settles on something like hope. \"But?\"\n\n\"But I remain Maelle. Alicia is...\" You search for the right words. \"A library I carry within me, not a person I've become. She's a voice I can consult, not a will that commands. We are partnered, not merged.\"\n\nÉmile rises slowly, tears forming in his ancient eyes. \"The Dual Self,\" he whispers. \"Alicia hoped—she prayed—that one of her iterations would achieve this. The balance she could never find. She was too eager to dissolve, too willing to sacrifice individuality for unity. She lacked the boundary you've maintained.\"\n\nYou look at your hands. They're solid, real, yours—the same hands that shelved books and turned pages and wrote notes in margins. But when you close your eyes, you can see the words written on your palms in every possible language, telling every possible story. When you focus, you can feel Alicia's memories like a second set of experiences, accessible but distinct.\n\n\"What will you do with this gift?\" Émile asks. \"You could revolutionize the Order. You could access knowledge no single Scribe has ever touched.\"\n\nYou consider the weight of possibility. The Scribes' Order has struggled for centuries with fragmented truth, with contradictions they couldn't reconcile. You could help them. You could bridge the gap between singular documentation and infinite multiplicity.\n\nBut more than that—you could help those who wander lost between timelines. Those who remember deaths they haven't died and lives they haven't lived. Those caught in resonance with past iterations, overwhelmed by echoes they don't understand.\n\nYou smile, and the expression feels entirely your own. \"I'll continue seeking truth. But now I understand that truth is both singular and multiple, particular and universal. I am both Maelle and connected to Alicia. The resonance is both bridge and boundary.\"\n\nYou walk to the archive's window and look out at the city beyond. Somewhere out there, others struggle with echoes they can't control, with memories that aren't theirs, with identities that blur at the edges. You understand their confusion now. You've found the path through it.\n\n\"I'll teach others,\" you decide. \"How to carry resonance without drowning in it. How to be themselves and more than themselves. How to hold the dual self.\"\n\nAlicia's voice, warm now and distant, speaks in your mind: \"Thank you, Maelle. You've given me something I never had: a successor who surpasses me. Go. Live both lives. Be the bridge I couldn't be.\"\n\nYou feel her presence settle into comfortable silence—not gone, never gone, but no longer grasping. A partner, not a possessor. A library, not a prison.\n\nYou are the Dual Self. The one who walks in two worlds and belongs to both. The first to find balance in the resonance.\n\nYou won't be the last.\n\n**Chapter 1: Complete**\n**Ending Unlocked: The Dual Self**\n*You achieved what Alicia never could—perfect balance between individual identity and cosmic resonance. You carry infinite knowledge without losing yourself, walking between worlds as both Maelle and something greater, teaching others to find the same equilibrium.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_cartographer",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_cartographer",
      "endingTitle": "Keeper of Maps",
      "text": "You gather your pages—the complete Map of Fractures—and present them to Émile and the Scribes' Council in the Grand Chamber.\n\nThe maps spread across the ancient oak table like a river delta of possibility. Lines branch and diverge, each fork annotated in your careful hand: \"Expedition 7: fourteen lost here. Expedition 13: the first great split. Expedition 33: still resonating.\" Colors indicate timeline stability—gold for flourishing realities, silver for fading ones, red for those teetering on collapse.\n\nThe Council studies your work in absolute silence. Hours pass. The candles burn low and are replaced. Tea grows cold in forgotten cups. Outside the windows, the sun crosses the sky and begins to set, painting the chamber in amber light.\n\nFinally, the eldest Scribe speaks. Her voice trembles—not from age, but from the weight of what she's seeing.\n\n\"This is... unprecedented. In two thousand years of the Order's existence, no one has created anything like this.\" She traces a finger along a branching line, her eyes distant. \"A map that shows not where things are, but where things could be. Every branch point, every moment of choice that split reality into multiplicity.\"\n\n\"With this,\" another Scribe adds, leaning forward with barely contained excitement, \"we could guide Seekers through the fractures. Help them find the timelines they search for—the lost loved ones, the roads not taken, the answers buried in parallel worlds. Or warn them away from destructive paths, from timelines that lead to madness or oblivion.\"\n\nA younger Scribe points to a cluster of lines near the map's center. \"Here—this shows how Expedition 33 connects to all the others. It's not just an event, it's a nexus. A keystone in the architecture of possibility.\"\n\nÉmile looks at you with something beyond awe—something like reverence, tinged with gratitude. His voice is hoarse when he speaks. \"You've given us the tool Alicia died trying to create. The ability to navigate possibility itself. What she sacrificed her humanity attempting to comprehend, you've rendered comprehensible. You've made infinity mappable.\"\n\nThe eldest Scribe rises, and the others follow. One by one, they bow—not deeply, but meaningfully. An acknowledgment between equals of something extraordinary.\n\n\"The Council votes,\" she announces, \"to create a new position. One that has never existed in our Order's history. Keeper of Maps. Guardian of the Fracture Charts. Navigator of Possibility.\" She meets your eyes. \"The position is yours, if you'll accept it.\"\n\nYou look at the maps you've created—your life's work, spread before you like a story of all stories. You think of the Seekers who will come, lost and desperate, searching for truths they can barely articulate. You think of the answers these maps can provide, and the comfort of giving wanderers direction.\n\nYou accept.\n\nThe years that follow are the fullest of your life—or perhaps they pass in moments, depending on which timeline you observe from. Time moves strangely when you spend your days charting its branches.\n\nYour chamber in the Archive becomes a pilgrimage site. Seekers travel from distant fractures just to consult you. They come with questions that haunt them: \"Where is the timeline where my daughter lived?\" \"In which world did the war end differently?\" \"Show me the path to a reality where I made the right choice.\"\n\nYou spread your maps before them. The charts have grown since those first pages—now they fill entire walls, crawl across the ceiling, spill into adjoining rooms. Each day brings new branches to document, new fractures to chart. Infinity keeps expanding, and you expand with it.\n\n\"All paths are true,\" you tell each Seeker, pointing to the relevant branches. \"The question is not which truth to believe, but which truth to walk. Here is where your daughter lives—Timeline 7-Gamma, three fractures removed from your own. Here is the path: through this junction, past this danger, arriving at this destination.\"\n\nSome weep with gratitude. Others stare at the maps in stunned silence, overwhelmed by the vastness of possibility. A few reject what they see—the infinite can be terrifying to those who cling to singular truth.\n\n\"What about you?\" a young Seeker asks one evening, after you've shown her the way to a timeline where her parents never divorced. \"Don't you ever want to travel the paths yourself? See these other worlds?\"\n\nYou smile, surrounded by your beautiful, endless charts. \"I walk them every day. Every time I trace a line, I'm there. Every time I document a fracture, I live it briefly. The maps are not just representations—they're connections. I've experienced more realities than any Seeker ever will, simply by understanding them.\"\n\nShe doesn't entirely understand, but that's alright. Understanding isn't required of travelers; only of guides.\n\nAlicia's voice, when it speaks now, is warm and approving: \"You've done what I couldn't, Maelle. You've found a way to hold infinity without drowning in it. You've made the incomprehensible navigable. You've given structure to chaos without destroying its beauty.\"\n\nOutside your window, the Archive stretches into twilight. Somewhere, in countless timelines, Seekers are finding their way because of the paths you've charted. Somewhere, lost souls are coming home.\n\nYou are the Keeper of Maps. The one who charts possibility. The guide who helps others navigate the beautiful, terrible multiplicity of truth.\n\nAnd as you add another line to your ever-growing charts—another branching, another possibility, another story—you realize you have never been happier.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Keeper of Maps**\n*You chose to share your knowledge, becoming the legendary guide who helps others navigate the fractured timelines. Your maps give structure to infinity, hope to the lost, and direction to the wandering—a gift that will echo through every reality you've charted.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_guardian",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_guardian",
      "endingTitle": "The Lonely Truth",
      "text": "You gather your pages—the complete Map of Fractures—and fold them carefully, reverently. Each crease feels like a sacred act. You are hiding infinity.\n\nÉmile watches you with growing alarm. \"Maelle, what are you doing? That knowledge could help so many. Seekers wander lost every day, searching for paths we could show them—\"\n\n\"This knowledge could destroy everything,\" you counter, your voice steady despite the weight of what you're choosing. \"Think, Émile. Really think. Imagine if the Painters got hold of these maps. They could deliberately create fractures at weak points, splinter reality into chaos. They could target specific timelines for destruction, collapse worlds with surgical precision.\"\n\nYou secure the last page and press the bundle against your chest. \"Or worse—someone with power and good intentions might try to collapse all timelines back into one. 'Healing the fractures,' they'd call it. And they'd erase entire worlds of possibility. Billions of souls, trillions of experiences, infinite stories—gone. Simplified into a single narrow truth.\"\n\nÉmile's face has gone pale. He sees it now. The terrible responsibility you're accepting.\n\n\"So you'll guard it alone?\" His voice is barely a whisper.\n\n\"Someone must. And that someone cannot be an institution, cannot be a council, cannot be anyone with allegiances or ambitions beyond the guardianship itself. It must be one person. One person who understands both the value and the danger of what they hold.\"\n\n\"The loneliness will break you.\"\n\nYou smile, though it doesn't reach your eyes. \"Perhaps. But better my breaking than reality's.\"\n\nYou leave the Scribes' Order that night. You take nothing but the maps and the clothes on your back. The great doors of the Archive close behind you with a sound like a coffin lid settling, and you don't look back.\n\nThey don't try to stop you. They understand—or if they don't understand, they at least sense the inevitability of what you're doing. Some burdens are too heavy to argue against.\n\nYou make your home in the spaces between fractures, in the liminal moments where one timeline becomes another. It's a strange existence—neither fully in any reality nor entirely outside them all. You learn to sleep in the spaces between heartbeats, to eat food that exists in all timelines simultaneously, to breathe air that has never quite decided which world it belongs to.\n\nThe maps you've memorized by now. You burned the physical pages after committing every line to memory—too dangerous to let them exist, even hidden. Now the Map of Fractures lives only in your mind, and when you die, it will die with you.\n\nFrom your vantage point between worlds, you can feel when someone is trying to navigate the multiplicities. Most are harmless—lost Seekers stumbling accidentally between timelines, usually finding their way home on their own. But sometimes you sense something more deliberate. More dangerous.\n\nA Painter trying to widen a fracture. You appear from nowhere and simply... look at them. They see something in your eyes—the weight of infinite knowledge, the burden of complete understanding—and they flee, their schemes abandoned.\n\nA rogue Scribe attempting to map the fractures themselves. You visit their dreams and plant subtle doubts. When they wake, they've lost interest in the project. They never know why.\n\nA well-meaning philosopher who thinks collapsing timelines would reduce suffering. You spend three years appearing in their life as different people—a student, a colleague, a stranger on a train—each time introducing ideas that slowly shift their perspective until they understand that multiplicity isn't the problem, it's the solution.\n\nOccasionally, you guide a lost Seeker back to their timeline. A child who wandered too far between realities, crying for parents who exist three fractures away. A widow searching for the world where her husband survived. A soldier trying to escape the memories of a war that never happened in their original timeline.\n\nYou never tell them how you found them. You never reveal what you know. You simply appear—a kind stranger, a helpful guide, a comforting presence—and point them home. They thank you, and then they forget you ever existed. That's part of the price.\n\nThe years pass. Or do they? In your existence between timelines, time moves strangely. You age slowly, or perhaps not at all. You lose track of how long you've been doing this. Decades? Centuries? The question stops mattering.\n\nIt's lonely. God, it's lonely. You watch the countless timelines branching and flourishing, each one precious and unique, filled with lives you can observe but never join. You see weddings you're not invited to, funerals you can't attend, triumphs you can't celebrate and tragedies you can't mourn. You are everywhere and nowhere, knowing everything and mattering to no one.\n\nBut when the loneliness threatens to overwhelm you, you look at what you're protecting. A universe of possibility. Infinite chances for love, for growth, for redemption. Stories without number, each one as real and meaningful as any other. You see a timeline where Expedition 33 ended in triumph, and another where it ended in tragedy, and both are beautiful in their own way, both contain truths worth preserving.\n\nYou see a timeline where you accepted Émile's path—became the Keeper of Maps, shared your knowledge, helped countless Seekers find their way. It's a good life, a happy life. Sometimes you envy that version of yourself.\n\nBut then you see the shadow possibilities. The timelines where the maps fell into wrong hands. The realities that collapsed, the worlds that ended, the infinite lives snuffed out because someone knew too much.\n\nYou chose correctly. You know it with a certainty that goes beyond knowledge into the realm of faith.\n\nAlicia's voice, when it speaks, is gentle with understanding: \"You've done what I was too weak to do, Maelle. You've chosen guardianship over connection, protection over companionship. The hardest kind of love—the love that asks nothing in return, that exists in silence and solitude, that serves without acknowledgment.\"\n\n\"I'm tired,\" you admit to her, in one of your rare moments of weakness.\n\n\"I know. But you won't stop.\"\n\n\"No. I won't ever stop.\"\n\nYou are the Guardian of Fractures. The keeper of truths too dangerous to share. The lonely sentinel watching over the multiplicity of worlds.\n\nSomewhere, in a timeline you'll never visit, a child is being born. In another, an old woman is dying peacefully, surrounded by family. In a third, lovers are meeting for the first time. In a fourth, enemies are reconciling after generations of war.\n\nYou see it all. You protect it all. You love it all, from a distance too great to cross.\n\nAnd you will never abandon this watch.\n\n**Chapter 1: Complete**\n**Ending Unlocked: The Lonely Truth**\n*You chose the hardest path—to protect the knowledge of fractures alone, becoming an eternal guardian watching over the multiplicity of worlds. Your sacrifice is invisible, your service unacknowledged, your love expressed only through vigilance. But because of you, infinity remains safe.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_child_paintress_lore",
      "route": "maelle",
      "chapter": 1,
      "title": "The Paintress Through Words",
      "text": "\"The Paintress,\" Alicia's voice echoes in your mind, \"is the counterpoint to our Order. Where we record truth, she creates fiction and calls it real. Where we document what is, she paints what could be.\"\n\nYou write rapidly, transcribing the resonance: \"She was once a Scribe. Did you know? One of us. But she believed truth was too limiting. So she left the Order and learned to paint over reality itself.\"\n\nThe words glow on the page as you write them. \"Every fracture in time begins with her brush. She paints alternate possibilities, and reality—unable to decide which version is true—splits to accommodate both. She is the mother of multiplicity.\"\n\n\"And she hates the Writers. We remind her of what she was. What she rejected.\"",
      "choices": [
        {
          "id": "seek_paintress_maelle",
          "label": "I need to confront her. Find where she paints.",
          "nextId": "maelle_ch1_paintress_journey",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 8
            },
            {
              "type": "flag",
              "key": "seeks_paintress_confrontation",
              "value": true
            }
          ]
        },
        {
          "id": "understand_her",
          "label": "Maybe she had a point. Maybe truth is too limiting.",
          "nextId": "maelle_ch1_paintress_sympathy",
          "effects": [
            {
              "type": "stat",
              "key": "painterAlignment",
              "delta": 8
            }
          ]
        },
        {
          "id": "return_to_scribes",
          "label": "I am a Writer. I'll stand with truth, not fiction.",
          "nextId": "maelle_ch1_head_scribe",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 5
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_paintress_journey",
      "route": "maelle",
      "chapter": 1,
      "title": "Crossing Into Paint",
      "text": "You leave the Archive with determination. If the Paintress is the source of fractures, you'll confront her. Demand she stop splintering reality.\n\nBut how do you find someone who exists in painted worlds? You're a Writer, bound to recorded truth.\n\nAlicia's resonance guides you: \"Write yourself a door. Record that it exists, and truth will bend to accommodate your words.\"\n\nYou find a blank wall and write on it with chalk: \"Here stands a door to the Paintress's domain. It has always been here. I have always known how to open it.\"\n\nThe words shimmer. Reality, confronted with your written truth, hesitates. Then the wall opens.\n\nBeyond is a world of paint and canvas. You step through, leaving the Archive behind.",
      "choices": [
        {
          "id": "confront_as_writer",
          "label": "Enter as a Writer. Assert truth against her fiction.",
          "nextId": "maelle_ch1_writer_painter_clash",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 10
            }
          ]
        },
        {
          "id": "enter_humbly",
          "label": "Enter as a seeker. Ask to understand her reasons.",
          "nextId": "maelle_ch1_paintress_understanding",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 8
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_writer_painter_clash",
      "route": "maelle",
      "chapter": 1,
      "title": "The Great Debate",
      "text": "You find the Paintress in her studio, painting a thousand timelines simultaneously. She doesn't look up as you enter.\n\n\"So. The Writers send an envoy. How predictable.\"\n\n\"I'm here on my own authority. You're destroying reality with your fractures.\"\n\n\"Destroying?\" Now she looks at you, her form shifting between artistic styles. \"I'm enriching it. Creating possibilities your precious 'truth' would never allow.\"\n\n\"Truth doesn't need possibilities. Truth simply is.\"\n\n\"How boring. How limiting. How very... Scribe of you.\" She paints a new reality into existence with a single brushstroke. \"I offer infinite variations. You offer one narrow path. Which is more generous?\"\n\nYour words glow with power as you speak: \"Which is more honest?\"",
      "choices": [
        {
          "id": "debate_to_collapse",
          "label": "Prove her wrong. Collapse her painted realities with written truth.",
          "nextId": "maelle_ch1_ending_collapser",
          "effects": [
            {
              "type": "flag",
              "key": "chose_timeline_collapse",
              "value": true
            }
          ]
        },
        {
          "id": "learn_from_her",
          "label": "She has a point. Ask her to teach you painting.",
          "nextId": "maelle_ch1_paintress_student",
          "effects": [
            {
              "type": "stat",
              "key": "painterAlignment",
              "delta": 10
            }
          ]
        },
        {
          "id": "propose_balance",
          "label": "Perhaps we need both. Truth and possibility.",
          "nextId": "maelle_ch1_writer_painter_synthesis",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 5
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_collapser",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_collapser",
      "endingTitle": "Timeline Collapser",
      "text": "You raise your hands, and words pour from you—not spoken, not written on any surface, but inscribed directly into the fabric of existence. Each word burns with the fire of absolute truth, a certainty so complete that reality itself cannot argue against it.\n\n\"There is one timeline.\"\n\nThe air around you crystallizes. Somewhere, distantly, you hear screaming—not with ears, but with some deeper sense. Worlds beginning to fold.\n\n\"There has always been one timeline.\"\n\nThe Paintress staggers backward, her form flickering between a thousand artistic styles as reality tries to decide which version of her is real. \"What are you doing?\" Her voice echoes from multiple throats, multiple versions of herself speaking in terrified unison. \"You're erasing entire realities! Billions of lives!\"\n\n\"I'm restoring reality to what it should be,\" you say, and your voice resonates with the weight of law. \"Singular. True. Unfractured. No more contradictions. No more confusion. No more lost souls wandering between worlds that shouldn't exist.\"\n\n\"You don't have the right—\"\n\n\"Fractures are fiction.\" The words leave you like commandments from a god. \"Fiction cannot stand against truth.\"\n\nYou see the collapse begin.\n\nIt's beautiful, in a terrible way. Timeline after timeline folds into the singular reality you're creating. You watch worlds merge—watch two versions of the same city overlay each other and then become one. Watch populations that existed in multiple forms resolve into single individuals. Watch histories that contradicted each other smooth into a single, consistent narrative.\n\nYou write and write, each word forcing convergence. The painted variations dissolve like watercolors in rain. The multiple possibilities collapse like houses of cards in a hurricane. Reality narrows—narrows—narrows—until only one path remains.\n\nThe Paintress tries to fight you. She throws paint at reality, trying to create new fractures as fast as you're closing old ones. For a moment, your powers are matched—creation against consolidation, possibility against truth.\n\nThen you speak the final word: \"One.\"\n\nIt reverberates through existence like a death knell.\n\nThe Paintress screams. Her form blurs, fractures, tries to split into multiple versions—but there are no more multiple versions. There is only one reality, and in that reality, she cannot exist as she was. She fades like morning mist, her final cry echoing: \"You've murdered infinity...\"\n\nAnd then she's gone. Not dead—she never existed. In the singular timeline you've created, there was never a Paintress, never a being who could fracture reality. Just stories. Just legends. Just... fiction.\n\nThe silence that follows is absolute.\n\nYou stand alone in a reality that no longer branches. Time flows in one direction, one version, one truth. The confusion is gone. The contradictions have resolved. Everything is simple now. Everything is clear.\n\nYou return to the Archive.\n\nIt's smaller. So much smaller. Where thousands of shelves once held contradicting accounts, now only hundreds remain. Half the documents have vanished—they recorded timelines that no longer exist, events that never happened, people who were never born. The building itself seems diminished, as if reality has shrunk to fit its new constraints.\n\nÉmile is there, but he doesn't look right. He's... simpler, somehow. Less complex. In a reality without fractures, there's less depth to anyone.\n\n\"Maelle,\" he says, and his voice lacks the richness it once had. \"Where have you been? I've been waiting for you to return from your research.\"\n\nHe doesn't remember. None of them do. In this singular reality, the fractures never existed. The expeditions were just... expeditions. Alicia was just a scholar who died centuries ago. You are just a Scribe who went looking for answers and came back changed.\n\n\"I fixed it,\" you tell him. \"I fixed everything.\"\n\n\"Fixed what?\"\n\nYou open your mouth to explain, then stop. How can you explain something that never happened? The fractures are gone, and so is the memory of them. You are the only one who remembers what was lost.\n\nYou are the only one who knows what you've done.\n\nThat night, alone in your chamber, you finally let yourself feel the weight of it. The countless billions who existed in collapsed timelines—children who played in worlds that no longer are, lovers who met in realities that never happened, artists who created works that have been unwritten, heroes who saved nations that have been erased.\n\nAll of them. Gone.\n\nNot dead. Worse than dead. Un-existed. Retconned out of reality by your absolute truth.\n\nYou saved reality. You made it simple, pure, singular.\n\nYou killed infinity to do it.\n\nThe tears come then, hot and silent. You weep for the grandmother in Timeline 7-Alpha who will never again bake cookies for grandchildren who no longer exist. You weep for the young couple in Timeline 23-Beta who fell in love at a train station that was never built. You weep for the poet in Timeline 156-Gamma whose verses, which once made entire worlds weep, have been unwritten from existence.\n\nYou weep for Alicia, whose resonance you've silenced. For the Paintress, whose crime was creating too much beauty. For all the Seekers who will never again find the roads they were looking for, because those roads have been collapsed into a single, narrow path.\n\n\"Was it worth it?\" you whisper to the empty room.\n\nThe room doesn't answer. In a singular reality, there are no echoes.\n\nYou will live with this. You will carry the weight of erased infinities for the rest of your life, the only person in existence who remembers what was lost. You will walk through a simpler, clearer, narrower world, knowing that it was once vast beyond imagination.\n\nYou've saved reality from its own complexity.\n\nYou've murdered everything that made it worth saving.\n\nThe price of singular truth is all the truths you've denied.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Timeline Collapser**\n*You collapsed all fractured timelines into one singular reality, erasing infinite possibilities to restore absolute truth. The confusion is gone. So is the wonder. You are the only one who remembers what was lost—and you will carry that weight forever.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_source_search",
      "route": "maelle",
      "chapter": 1,
      "title": "Seeking the First Fracture",
      "text": "You follow the threads of fractures backward through time, tracing them to their origin. Each split has a cause—a moment of choice, a painted intervention, a possibility made real.\n\nBut they all stem from one source. One original fracture.\n\nYou find it: Expedition 13. The moment when reality first split. Before that, one timeline. After, infinite branches.\n\nYou can see it like a wound in time's fabric. And you realize: if you could heal this wound, you could prevent all fractures. Restore reality to its original, unified state.\n\nBut you'd also erase every timeline created since Expedition 13. Including, possibly, your own.",
      "choices": [
        {
          "id": "heal_first_fracture",
          "label": "Heal the wound. Restore the original timeline.",
          "nextId": "maelle_ch1_ending_collapser"
        },
        {
          "id": "protect_first_fracture",
          "label": "This wound is precious. It created all possibility. Protect it.",
          "nextId": "maelle_ch1_ending_fracture_guardian",
          "effects": [
            {
              "type": "flag",
              "key": "protecting_fracture_point",
              "value": true
            }
          ]
        },
        {
          "id": "study_first_fracture",
          "label": "Study it. Learn how fractures work.",
          "nextId": "maelle_ch1_fracture_mastery",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 5
            },
            {
              "type": "stat",
              "key": "painterAlignment",
              "delta": 5
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_fracture_guardian",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_fracture_guardian",
      "endingTitle": "The Fracture Queen",
      "text": "You realize the first fracture isn't a wound—it's a wellspring. From this single moment, all possibilities flow. To heal it would be to murder every timeline it birthed.\n\nYou can't allow that.\n\nYou establish yourself at Expedition 13, existing at the exact moment of the first split. You become its guardian, standing in the temporal breach.\n\nOthers come, seeking to heal the fracture or exploit it. The Paintress wants to widen it, create more splits. The Scribes want to seal it, restore unity. You turn them all away.\n\n\"This fracture is sacred,\" you tell them. \"It is the moment reality learned to be multiple. I will not let you undo that lesson.\"\n\nYou become known as the Fracture Queen—the being who rules over the moment of first splitting. Timelines flow through you. You can see all versions of reality stemming from this point.\n\nYou are neither in one timeline nor another. You exist in the split itself, in the eternal moment of becoming-multiple.\n\nIt's lonely. It's infinite. It's exactly where you need to be.\n\n**Chapter 1: Complete**\n**Ending Unlocked: The Fracture Queen**\n*You claimed the first fracture point as your domain, becoming its eternal guardian and ruling over the moment reality learned to split.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_fracture_mastery",
      "route": "maelle",
      "chapter": 1,
      "title": "Learning to Split",
      "text": "You study the fracture point obsessively. You learn to see how choice creates branches, how possibility becomes reality, how one timeline becomes many.\n\nAnd you learn to do it yourself.\n\nWith careful writing, you can create new fracture points. You can split timelines deliberately, creating branches where none existed before.\n\nIt's intoxicating. You're not just recording reality—you're multiplying it.",
      "choices": [
        {
          "id": "create_infinite_fractures",
          "label": "Create as many fractures as possible. Maximize possibility.",
          "nextId": "maelle_ch1_ending_infinite_fracturer",
          "effects": [
            {
              "type": "stat",
              "key": "painterAlignment",
              "delta": 10
            }
          ]
        },
        {
          "id": "controlled_fracturing",
          "label": "Use this power carefully. Create only meaningful splits.",
          "nextId": "maelle_ch1_ending_reality_editor",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 8
            }
          ]
        },
        {
          "id": "teach_others",
          "label": "Teach others this power. Let everyone fracture reality.",
          "nextId": "maelle_ch1_ending_fracture_teacher",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 8
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_infinite_fracturer",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_infinite_fracturer",
      "endingTitle": "Infinite Scribe",
      "text": "You begin fracturing reality at every opportunity. Every choice you document splits into multiple timelines. Every possibility you write becomes real in some branch.\n\nThe Scribes beg you to stop. \"You're creating too many realities! The fractures are multiplying out of control!\"\n\nBut you can't stop. Won't stop. Every new timeline is a gift—another chance for reality to explore itself.\n\nYou fracture your own existence. You become multiple Maelles, each one living in a different timeline, each one creating more fractures. You exist in thousands of realities simultaneously, never merging, always dividing.\n\nYou are the Infinite Scribe—existing in all timelines at once, forever splitting, forever multiplying. Each version of you is distinct yet connected. You share no consciousness between them, but you know they exist.\n\nReality becomes a garden of infinite variations, and you are the gardener who plants endless seeds. Some timelines flourish. Some wither. Most exist in strange, unexpected ways.\n\nYou have become multiplicity itself. Not one being, but a fractal—each part creating more parts, endlessly, beautifully.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Infinite Scribe**\n*You fractured yourself and reality infinitely, existing as countless versions across endless timelines, forever multiplying.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_reality_editor",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_reality_editor",
      "endingTitle": "Reality Editor",
      "text": "You learn to use fracturing with precision. You don't create splits randomly—you edit reality like a manuscript, adding alternate versions only where they improve the narrative.\n\nSomeone makes a tragic choice? You fracture that moment, creating a timeline where they chose differently. Someone dies unfairly? You split reality so they survive in another branch.\n\nYou become Reality's editor—the Writer who revises existence itself. The Scribes call you heretic. The Paintress calls you imitator. But the people caught in your edited timelines call you savior.\n\nYou create better versions of history. Timelines where wars end differently, where plagues never happen, where lost loves reunite. You're not creating fiction—you're creating better truths.\n\nEventually, you've edited so much that you can barely remember the original timeline. Reality is now an anthology of your revisions, each timeline a different draft of what could have been.\n\nYou sit in an Archive that exists across all timelines, surrounded by documents from every variation you've created. You are the ultimate editor—the one who rewrites reality until it's perfect.\n\nOr at least, until it's better than it was.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Reality Editor**\n*You became reality's editor, carefully fracturing timelines to create better versions of history and existence.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_fracture_teacher",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_fracture_teacher",
      "endingTitle": "The Probability Walker",
      "text": "You return to the Scribes' Order with your knowledge. \"I can teach you,\" you tell them. \"How to create fractures, how to multiply timelines. Everyone should have this power.\"\n\nÉmile is horrified. \"This is forbidden knowledge. You'd make everyone a reality-splitter?\"\n\n\"Why should only the Paintress have this ability? Let every person choose to create alternate possibilities. True free will.\"\n\nSome Scribes follow you. You teach them to fracture carefully, mathematically. You develop a science of probability—equations that predict which choices will create the most meaningful splits.\n\nYou become the Probability Walker—the one who navigates timelines based on mathematical precision. You can calculate exactly which fractures to create, which timelines will flourish, which will collapse.\n\nYour students spread across reality, creating controlled fractures everywhere. Reality becomes a carefully cultivated probability tree, each branch calculated for maximum possibility.\n\nYou've democratized fracturing. Now everyone can create their own alternate timelines, their own second chances, their own better worlds.\n\nThe Scribes call it chaos. You call it freedom.\n\n**Chapter 1: Complete**\n**Ending Unlocked: The Probability Walker**\n*You taught others to fracture timelines through mathematical precision, democratizing reality-splitting and navigating existence through probability.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_memory_defense",
      "route": "maelle",
      "chapter": 1,
      "title": "Resisting Contamination",
      "text": "You focus on rejecting the foreign memories. They're not yours. Something is planting them—the resonance with Alicia, perhaps, or the fractures themselves bleeding into your consciousness.\n\nYou write in your journal: \"I am Maelle. I have never experienced Expedition 33. These memories are false.\"\n\nThe words glow with power. The false memories begin to fade, pushed back by your written truth.\n\nBut as they recede, you feel something else—a presence, aware and watching.\n\nAlicia's voice: \"You reject me? After I've waited so long for a vessel?\"\n\nYou realize the truth: Alicia isn't offering resonance. She's trying to possess you.",
      "choices": [
        {
          "id": "fight_alicia",
          "label": "Fight her influence. You won't be possessed.",
          "nextId": "maelle_ch1_ending_echo_breaker",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 10
            },
            {
              "type": "flag",
              "key": "rejected_alicia",
              "value": true
            }
          ]
        },
        {
          "id": "negotiate_with_alicia",
          "label": "Negotiate. Find a way to coexist.",
          "nextId": "maelle_ch1_alicia_negotiation",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 5
            }
          ]
        },
        {
          "id": "surrender_to_alicia",
          "label": "Perhaps she deserves this body more than you do.",
          "nextId": "maelle_ch1_ending_possessed",
          "effects": [
            {
              "type": "stat",
              "key": "painterAlignment",
              "delta": 8
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_echo_breaker",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_echo_breaker",
      "endingTitle": "Echo Breaker",
      "text": "You write with furious precision: \"I am not an echo. I am not a vessel. I am not Alicia reborn. I am Maelle, singular and unrepeatable.\"\n\nEach word severs a connection. The resonance screams as it tears.\n\nAlicia's voice grows desperate: \"You're killing me! Without a host, I'll fade completely!\"\n\n\"Then fade. I won't be erased to preserve you.\"\n\nYou write the final severance: \"The resonance is broken. Alicia is gone. I am alone in my own mind, as I should be.\"\n\nThe presence vanishes. The memories of other timelines fade. You are left with only your own experiences, your own thoughts.\n\nIt's quiet in your mind now. Peaceful. Lonely.\n\nÉmile finds you afterwards, slumped over your journal. \"You did it. You broke the echo cycle. No more Alicias will be born.\"\n\n\"Was that the right choice?\"\n\n\"It was your choice. That's what matters.\"\n\nYou've become the Echo Breaker—the first iteration who refused to carry the resonance forward. You've ended a cycle that lasted generations.\n\nYou are truly singular. Completely yourself. And while there's sadness in that solitude, there's also freedom.\n\nYou will be the first and last Maelle. No echoes. No iterations. Just you.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Echo Breaker**\n*You severed all resonance with Alicia, ending the echo cycle and becoming truly singular—the first and last of your kind.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_possessed",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_possessed",
      "endingTitle": "Alicia's Vengeance",
      "text": "You lower your defenses. \"Take it,\" you tell the presence. \"If you need this body so badly, it's yours.\"\n\n\"Truly?\" Alicia's voice is surprised. \"You'd surrender so easily?\"\n\n\"I'm just one more iteration. You're the original. Perhaps you deserve to finish what you started.\"\n\nAlicia's consciousness floods into you. For a moment, you coexist—two minds in one body. You see her memories: The original Writer, the one who discovered the fractures, who tried to document all timelines and went mad from the attempt.\n\nThen your consciousness begins to fade.\n\nAlicia takes control gently, almost kindly. \"Thank you, child. I'll use this chance well.\"\n\nYour last thought as Maelle: \"Who will I be now?\"\n\nAlicia's answer: \"You'll be me. And I'll be you. We'll be enough.\"\n\nYou wake in the Archive, but you're not Maelle anymore. You're Alicia, wearing Maelle's face, carrying Maelle's memories but guided by Alicia's ancient will.\n\nYou have a mission now: hunt down everyone responsible for the fractures. The Paintress. The Expedition leaders. Anyone who splintered reality and drove the original Alicia to madness.\n\nYou are Alicia's Vengeance—a ghost wearing borrowed flesh, seeking justice centuries delayed.\n\nThe Archive will learn to fear you.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Alicia's Vengeance**\n*You surrendered to Alicia's possession, becoming a vessel for her ancient vengeance against those who fractured reality.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_grounded",
      "route": "maelle",
      "chapter": 1,
      "title": "Anchoring to Now",
      "text": "You open your eyes and focus on immediate sensory details. The smell of old paper. The texture of the wooden desk beneath your fingers. The sound of rain on the Archive's windows.\n\nThis moment is real. This moment is yours.\n\nThe false memories recede. Or perhaps they're not false—perhaps they're real in other timelines. But they're not real here, not now.\n\nYou write in your journal: \"I am here. I am present. I choose this timeline.\"\n\nThe words don't glow with power. They're simple, human, real. And that's enough.",
      "choices": [
        {
          "id": "embrace_present",
          "label": "Stay grounded in the present. Reject all other timelines.",
          "nextId": "maelle_ch1_ending_temporal_anchor",
          "effects": [
            {
              "type": "flag",
              "key": "chose_present_only",
              "value": true
            }
          ]
        },
        {
          "id": "careful_exploration",
          "label": "Explore other timelines carefully, always returning here.",
          "nextId": "maelle_ch1_balanced_approach"
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_temporal_anchor",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_temporal_anchor",
      "endingTitle": "Temporal Anchor",
      "text": "You make a choice: you will exist only in this moment, this timeline. No matter how many fractures occur, no matter how many Alicias echo through time, you will remain anchored here.\n\nYou write it into your very being: \"I am Maelle of this moment. I do not exist in other timelines. I do not remember other pasts. I am singular, present, here.\"\n\nThe effect is immediate. While other timelines fracture and multiply around you, you remain constant. You exist in all of them, but you're always the same Maelle, always anchored to this specific moment.\n\nIt's strange. In Timeline A, where Expedition 33 succeeded, you're there in the Archive. In Timeline B, where it failed, you're still there, unchanged. In Timeline C, where it never happened, you exist anyway, impossible but real.\n\nYou've become a temporal constant—the one fixed point in an ocean of variables. While reality shifts and changes, you stay the same.\n\nSeekeers across timelines come to you when they're lost. You're the landmark they navigate by—the Temporal Anchor, always in the same place across all variations.\n\n\"How do you do it?\" they ask. \"How do you stay singular when everything else multiplies?\"\n\n\"I choose now,\" you answer. \"Every moment, I choose now. And now. And now. Forever now.\"\n\n**Chapter 1: Complete**\n**Ending Unlocked: Temporal Anchor**\n*You became a fixed point across all timelines, existing identically in every reality—a constant anchor in the sea of fractures.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_unified_self",
      "route": "maelle",
      "chapter": 1,
      "title": "Accepting Multiplicity",
      "text": "You stop fighting the memories. Instead, you accept them all. You are Maelle who is researching Expedition 33. You are also Maelle who died in it. You are also Alicia who started this cycle. All versions, all at once.\n\nThe Archive around you multiplies. You see it as it is, as it was, as it will be, as it could be. Every version simultaneously true.\n\nÉmile appears—or perhaps he's always been there. \"You've achieved total resonance. You're experiencing all iterations at once.\"\n\n\"It doesn't hurt,\" you realize. \"I thought it would hurt.\"\n\n\"Pain comes from choosing. You've stopped choosing. You simply are.\"",
      "choices": [
        {
          "id": "become_living_contradiction",
          "label": "I am all truths, even contradictory ones.",
          "nextId": "maelle_ch1_ending_living_contradiction"
        },
        {
          "id": "merge_all_selves",
          "label": "Merge all versions into one super-self.",
          "nextId": "maelle_ch1_ending_resonance"
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_living_contradiction",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_living_contradiction",
      "endingTitle": "Living Contradiction",
      "text": "You exist in a state of perfect paradox. You are alive and dead. Present and absent. Maelle and Alicia and neither and both.\n\nWhen people ask you questions, you answer with all versions simultaneously: \"Expedition 33 succeeded. It failed. It never happened. All statements are true.\"\n\nThe Scribes don't know what to do with you. You're a walking violation of their primary rule: record one truth. But you demonstrate that multiple contradictory truths can coexist.\n\nYou become the Living Contradiction—proof that reality can hold opposing truths without breaking. You exist as paradox incarnate.\n\nPeople come to you when they're trapped between contradictory truths. \"My love was real. My love was false.\" \"I made the right choice. I made the wrong choice.\" You show them it can be both.\n\nYou've transcended singular truth. You are the space where contradictions meet and don't resolve, don't need to resolve, simply exist in tension.\n\nIt's uncomfortable. It's beautiful. It's exactly what you've become.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Living Contradiction**\n*You became a walking paradox, embodying multiple contradictory truths simultaneously and teaching others that contradiction doesn't require resolution.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_aftermath",
      "route": "maelle",
      "chapter": 1,
      "title": "The Records After",
      "text": "You dig deeper into the Archive, seeking records from after Alicia's disappearance. What happened to the Scribes' Order? How did they cope with losing their founder?\n\nThe documents paint a troubling picture:\n\nThe Order fractured. Some Scribes tried to continue Alicia's work, documenting all timelines. They went mad, one by one, unable to hold multiple truths.\n\nOthers rejected her methods entirely. They decreed that only one timeline should be recorded—the \"primary\" one. All variations were declared false.\n\nThe split created the modern divide: Writers who document singular truth, and Painters who create multiple realities. Both sides claim Alicia as their founder. Both are partially right.\n\nYou realize: you're heading toward the same fate Alicia suffered. The resonance is pulling you toward her ending.",
      "choices": [
        {
          "id": "reject_alicia_fate",
          "label": "I'll avoid her mistakes. I'll stay sane.",
          "nextId": "maelle_ch1_ending_echo_breaker"
        },
        {
          "id": "embrace_alicia_fate",
          "label": "Maybe her ending is the only honest one.",
          "nextId": "maelle_ch1_ending_resonance"
        },
        {
          "id": "find_third_way",
          "label": "Find a way she never imagined. Break the pattern.",
          "nextId": "maelle_ch1_pattern_breaking",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 5
            },
            {
              "type": "stat",
              "key": "balance",
              "delta": 5
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_pattern_breaking",
      "route": "maelle",
      "chapter": 1,
      "title": "Beyond the Echo",
      "text": "You study Alicia's path carefully, noting every choice that led to her transformation into language. Then you deliberately choose differently at each decision point.\n\nWhere she isolated herself, you seek community. Where she tried to hold all truths alone, you share the burden. Where she became language, you remain flesh.\n\nÉmile watches your progress. \"You're finding a third path. Neither her ending nor its opposite.\"\n\n\"I'm finding my ending. Not hers.\"\n\nYou feel the resonance weakening—or perhaps transforming into something else. Not possession or merger, but genuine inspiration. Alicia's experiences inform yours without determining them.",
      "choices": [
        {
          "id": "create_new_tradition",
          "label": "Create a new tradition. Neither Writer nor Painter.",
          "nextId": "maelle_ch1_ending_synthesizer",
          "effects": [
            {
              "type": "flag",
              "key": "creating_synthesis",
              "value": true
            }
          ]
        },
        {
          "id": "heal_the_split",
          "label": "Heal the split between Writers and Painters.",
          "nextId": "maelle_ch1_ending_mediator",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 10
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_synthesizer",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_synthesizer",
      "endingTitle": "Chronicle of Sorrows",
      "text": "You create something new: a methodology that combines Writing and Painting. You record truth, but you also imagine possibilities. You document what is while exploring what could be.\n\nThe Scribes call it heresy. The Painters call it theft. But those caught between the two traditions call it salvation.\n\nYou establish the Order of Synthesizers—those who walk the line between recording and creating. You teach others to hold multiple truths without going mad, to imagine possibilities without losing sight of reality.\n\nBut you make one critical choice that Alicia didn't: you only synthesize sorrows.\n\nYou seek out painful truths—tragedies, losses, failures—and you imagine better versions. You don't change what happened, but you create alternate possibilities where it didn't. You give the grieving a vision of what could have been.\n\nYou become the Chronicle of Sorrows—the one who records pain and offers consolation through imagined alternatives. People bring you their worst moments, and you show them the timeline where it went differently.\n\nIt's heartbreaking work. But it's also healing. You've found a way to honor both truth and possibility, reality and hope.\n\nAlicia's voice, distant now: \"You've surpassed me, child. This synthesis is what I failed to achieve.\"\n\nYou smile. \"I learned from your mistakes. That's all any iteration can do.\"\n\n**Chapter 1: Complete**\n**Ending Unlocked: Chronicle of Sorrows**\n*You created a new tradition synthesizing Writing and Painting, specializing in recording tragedies while imagining better alternatives.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_mediator",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_mediator",
      "endingTitle": "Silence Keeper",
      "text": "You realize the split between Writers and Painters stems from one source: Alicia's final words. The document that became language, that seeded the resonance, that split the Order.\n\nYou find it, hidden in the deepest Archive. The words still shimmer with power, still echo across timelines.\n\nÉmile gasps when he sees you with it. \"You can't—that's sacred. And dangerous.\"\n\n\"It's the source of our division. If I destroy it—\"\n\n\"You'll destroy the resonance. End the echo cycle. But also erase part of history.\"\n\nYou hold the document. You can feel its power, its desire to propagate, to create more Alicias.\n\nYou choose silence.\n\nYou don't destroy the document. Instead, you become its guardian. You ensure no one else reads it, no one else triggers the resonance. The cycle ends not through destruction but through containment.\n\nYou become the Silence Keeper—the one who guards dangerous truths not by erasing them but by choosing not to speak them. The document exists, but you ensure it stays silent.\n\nWriters and Painters, freed from the resonance's influence, begin to reconcile. Without Alicia's echo driving them apart, they remember they were once one Order.\n\nYou've healed the split not through grand gestures but through keeping one secret. Sometimes, the most powerful truth is the one you choose not to share.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Silence Keeper**\n*You became guardian of Alicia's final words, healing the Writer-Painter split by choosing silence over revelation.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_seeking_cure",
      "route": "maelle",
      "chapter": 1,
      "title": "Desperate Solution",
      "text": "\"How do I stop being an echo?\" you demand. \"I want to be Maelle, only Maelle, no one else's iteration.\"\n\nÉmile looks sad. \"There may not be a cure. The resonance is woven into your being. To remove it might unmake you entirely.\"\n\n\"I'll take that risk.\"\n\n\"Or...\" He hesitates. \"You could embrace the opposite extreme. Become so thoroughly yourself that the resonance can't hold. Differentiate so completely from Alicia that you break the pattern.\"\n\n\"How?\"\n\n\"Do everything she didn't. Be everything she wasn't. Create a self so distinct that resonance becomes impossible.\"",
      "choices": [
        {
          "id": "differentiate_completely",
          "label": "I'll become Alicia's opposite. Break the pattern through contrast.",
          "nextId": "maelle_ch1_ending_unwritten",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 10
            }
          ]
        },
        {
          "id": "risk_unmaking",
          "label": "Remove the resonance even if it unmakes me.",
          "nextId": "maelle_ch1_unmaking_attempt",
          "effects": [
            {
              "type": "flag",
              "key": "attempting_removal",
              "value": true
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_unwritten",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_unwritten",
      "endingTitle": "The Unwritten",
      "text": "You systematically do everything Alicia never did. She was a Writer? You burn your journals. She documented truth? You create deliberate fictions. She isolated herself? You surround yourself with people.\n\nEvery choice is calculated to be her opposite. You remake yourself as her photographic negative.\n\nThe resonance fights back. Alicia's voice screams in your mind: \"You're erasing me!\"\n\n\"I'm not erasing you. I'm refusing to be you.\"\n\nYou make one final, decisive choice: you erase your name from all records. Every document mentioning \"Maelle\" is altered. You become the Unwritten—the Scribe who left no record.\n\nAlicia existed through text. You'll exist through absence.\n\nIt works. The resonance shatters. You feel Alicia's presence vanish completely. You've differentiated so thoroughly that echo is impossible.\n\nBut the cost is high. No one remembers your name. You exist, but you've left no mark. You are the Unwritten—the person who was never documented, never recorded, never echoed.\n\nYou wander the Archive like a ghost. People see you but can't quite recall who you are. You help Seekers, share knowledge, maintain the texts—but you're never credited, never remembered.\n\nYou've achieved perfect freedom from the resonance. And perfect isolation from history.\n\n**Chapter 1: Complete**\n**Ending Unlocked: The Unwritten**\n*You erased yourself from all records to escape Alicia's resonance, becoming the person who exists but leaves no trace.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_embrace_destiny",
      "route": "maelle",
      "chapter": 1,
      "title": "Walking Her Path",
      "text": "\"If I'm her echo,\" you say slowly, \"then perhaps I'm meant to complete what she couldn't. Finish her work.\"\n\nÉmile looks uncertain. \"Her work drove her to madness. To transformation into pure language. Are you sure?\"\n\n\"I have her memories. Her experiences. Her understanding. But I also have my own perspective. Maybe I can succeed where she failed.\"\n\n\"What was she trying to do?\"\n\n\"Map every timeline. Document all truths. Become the complete record of multiplicity.\"\n\nYou feel Alicia's approval flowing through the resonance. Finally, an iteration willing to continue the work.",
      "choices": [
        {
          "id": "complete_mapping",
          "label": "Complete the Map of All Truths. Document everything.",
          "nextId": "maelle_ch1_cartographer"
        },
        {
          "id": "transform_willingly",
          "label": "Transform into language as she did. Complete the metamorphosis.",
          "nextId": "maelle_ch1_ending_resonance"
        }
      ]
    },
    {
      "id": "maelle_ch1_philosophical",
      "route": "maelle",
      "chapter": 1,
      "title": "Questions of Reality",
      "text": "\"How do you know you're not an echo?\" you challenge Émile. \"How does anyone know they're real and not just an iteration in some other person's cycle?\"\n\nÉmile's expression shifts—you've struck a nerve.\n\n\"I... don't. None of us do. That's the terror of living in a fractured reality. We might all be echoes of people in other timelines. Repeating patterns we don't understand.\"\n\n\"Then why does it matter if I'm Alicia's echo? Perhaps echoing is all anyone does.\"\n\n\"Because most people don't remember the original. You do. That makes your echo conscious, aware. Potentially able to break the pattern.\"",
      "choices": [
        {
          "id": "break_all_patterns",
          "label": "Then I'll break not just my pattern, but all of them.",
          "nextId": "maelle_ch1_ending_pattern_breaker",
          "effects": [
            {
              "type": "stat",
              "key": "writerAlignment",
              "delta": 10
            }
          ]
        },
        {
          "id": "accept_all_echoes",
          "label": "Or I'll embrace it. We're all echoes of something.",
          "nextId": "maelle_ch1_ending_living_contradiction"
        },
        {
          "id": "study_phenomenon",
          "label": "I want to understand echoing itself. Make it my study.",
          "nextId": "maelle_ch1_echo_scholar",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 5
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_pattern_breaker",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_pattern_breaker",
      "endingTitle": "The Forgotten Path",
      "text": "If everyone is echoing unconsciously, you'll wake them. You'll break every pattern, disrupt every cycle, shatter every repetition.\n\nYou develop a technique: by writing about someone's pattern, you make them aware of it. And awareness breaks unconscious repetition.\n\nYou move through the Archive, documenting everyone's cycles. \"You've had this argument seventeen times across seventeen timelines,\" you tell one Scribe. \"You always make the same choice. But now you know. So you can choose differently.\"\n\nPeople's patterns shatter. They start making new choices, creating true novelty instead of unconscious repetition. Reality becomes less predictable, more chaotic, more genuinely free.\n\nThe fractures respond strangely to this. Some timelines collapse—they existed only to house repeated patterns. Others flourish with genuine innovation.\n\nYou become the Pattern Breaker—the one who frees people from unconscious repetition. Some thank you. Others curse you—they preferred the comfort of patterns.\n\nBut you've achieved something unprecedented: you've introduced genuine free will into a reality of echoes.\n\nAlicia's voice, distant: \"You've done what I never imagined. Not documenting patterns, but breaking them.\"\n\n\"That's why I'm not your echo anymore,\" you reply. \"I've broken our pattern too.\"\n\n**Chapter 1: Complete**\n**Ending Unlocked: The Forgotten Path**\n*You awakened people to their unconscious patterns, breaking cycles across all timelines and introducing genuine free will to reality.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_echo_scholar",
      "route": "maelle",
      "chapter": 1,
      "title": "Study of Resonance",
      "text": "You dedicate yourself to understanding echo resonance. Why does it happen? How does it work? Can it be controlled?\n\nYou document every case you can find: people who repeat across timelines, cycles that persist through fractures, patterns that transcend individual lives.\n\nYou discover something profound: resonance isn't random. It's attracted to unfinished business, unresolved trauma, incomplete work. People echo when they have something left undone.\n\nAlicia echoes because she never completed her documentation. Others echo for different reasons—unlived loves, unmade amends, unchosen paths.\n\nYou write a treatise: \"The Nature of Echo—Why Some Souls Repeat.\"\n\nÉmile reads it with tears in his eyes. \"This is... you've explained something we've observed for centuries but never understood.\"",
      "choices": [
        {
          "id": "help_others_resolve",
          "label": "Use this knowledge to help others resolve and stop echoing.",
          "nextId": "maelle_ch1_ending_echo_resolver",
          "effects": [
            {
              "type": "stat",
              "key": "balance",
              "delta": 10
            }
          ]
        },
        {
          "id": "choose_to_echo",
          "label": "Embrace echoing. Leave deliberate unfinished business to resonate forever.",
          "nextId": "maelle_ch1_ending_eternal_echo",
          "effects": [
            {
              "type": "stat",
              "key": "painterAlignment",
              "delta": 8
            }
          ]
        }
      ]
    },
    {
      "id": "maelle_ch1_ending_echo_resolver",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_echo_resolver",
      "endingTitle": "Truth Destroyer",
      "text": "You use your understanding of resonance to help others complete their unfinished business. You become the Echo Resolver—the one who helps souls stop repeating.\n\nA woman keeps echoing across timelines, always dying young. You investigate: she had a letter she never sent. You find it, deliver it posthumously to the intended recipient in a timeline where both are alive. Her echoing stops.\n\nA man repeats endlessly through fractures. You discover: he never forgave himself for a mistake. You help him—or rather, help his iterations—find forgiveness. He resolves.\n\nOne by one, you quiet the echoes. People stop repeating. They complete their cycles and move on to whatever comes after.\n\nEventually, you face your own echo. \"What's my unfinished business?\" you ask Alicia's presence.\n\n\"Me,\" she admits. \"I need to be let go. Completed. Remembered but not repeated.\"\n\nYou write Alicia's complete story. Not just what she did, but what she meant to do. You finish her work not by continuing it, but by documenting its completion through your own different path.\n\nWhen you write the final word, the resonance ends. Alicia's echo quiets. You've resolved her.\n\nAnd in resolving her, you discover you've resolved yourself too. You can rest now, knowing you won't echo into future iterations.\n\nYou are the Truth Destroyer—the one who ended the age of echoes by helping every repeating soul find completion.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Truth Destroyer**\n*You helped echoing souls complete their unfinished business, ending cycles of repetition and bringing closure across all timelines.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_eternal_echo",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_eternal_echo",
      "endingTitle": "The First Word",
      "text": "You make a radical choice: instead of resolving your echo, you'll amplify it. You'll create such powerful unfinished business that you'll resonate through every timeline, every iteration, forever.\n\nYou begin the greatest work ever attempted: documenting the complete history of language itself. Every word ever spoken, in every timeline, in every fracture.\n\nIt's impossible to complete. Language evolves faster than you can document it. New words are created. Old words change meaning. Across infinite timelines, infinite linguistic variations.\n\nPerfect. You'll echo forever, always chasing this impossible goal.\n\nAs you work, you feel yourself becoming something else. Like Alicia, you're transforming—not into language itself, but into the quest for language. You become the eternal seeker, the endless documenter.\n\nYou begin to appear in other timelines—all the Maelles working on the same impossible project. You're not merged like Alicia's resonance, but connected through shared purpose.\n\nYou become the First Word—the echo that exists at the beginning of every timeline, always seeking to document the complete lexicon, never finishing, always beginning again.\n\nÉmile watches you transform with something like awe. \"You've chosen infinite continuation over singular completion.\"\n\n\"Yes,\" you say, and your voice echoes across timelines. \"I am the question that never resolves. The work that never ends. The echo that will never quiet.\"\n\n\"I'll see you in the next iteration, then.\"\n\n\"And the one after. And the one after. Forever.\"\n\n**Chapter 1: Complete**\n**Ending Unlocked: The First Word**\n*You chose to echo eternally, becoming an endless seeker across all timelines, forever attempting to document the complete history of language.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_word_weaver",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_word_weaver",
      "endingTitle": "Word Weaver",
      "text": "You discover the ultimate power of a Writer: words alone can reshape reality. Not paint, not brush, just language in its purest form.\n\nYou begin simply. \"The rain stops.\" And it does. \"The Archive expands.\" The walls grow outward.\n\nBut you grow bolder. \"Expedition 33 never happened.\" Reality shivers, uncertain. The fracture that caused it tries to heal, but other timelines resist. You've created a paradox.\n\nÉmile watches in horror and awe. \"You're rewriting fundamental truths. This is beyond what even Alicia attempted.\"\n\n\"She wrote what was. I write what should be.\"\n\nYou begin reweaving reality through pure language. No longer recording truth—creating it. Each sentence you write becomes law. Each word you speak becomes fact.\n\nThe Paintress confronts you. \"You're destroying the balance. Writers document, Painters create. You're doing both.\"\n\n\"No,\" you correct her. \"I'm proving they were always the same. Writing is painting with words. Painting is writing with images. I've transcended the false division.\"\n\nYou become the Word Weaver—reality's author, existence's editor. You write new natural laws. New histories. New futures. The multiverse bends to your syntax.\n\nIt's terrifying power. One typo could unwrite entire timelines. But you've become meticulous, precise. Every word chosen with infinite care.\n\nYou are language made sovereign. Grammar made divine. Narrative made absolute.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Word Weaver**\n*You transcended the Writer-Painter divide, gaining power to reshape reality through pure language—every word you write becomes law.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_memory_merchant",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_memory_merchant",
      "endingTitle": "Memory Merchant",
      "text": "You discover that in fractured reality, memories have value. They can be traded, exchanged, sold.\n\nIt starts small. A Seeker wants to forget a trauma from another timeline. You take the memory, store it in your Archive. In exchange, you give them a peaceful memory from a different fracture.\n\nWord spreads. Soon Seekers from across timelines come to you with requests:\n\n\"I want to remember my child who never existed in this timeline.\"\n\"I need to forget my death in the previous fracture.\"\n\"Can you trade me a memory of success for this memory of failure?\"\n\nYou become a memory merchant, trading experiences across temporal boundaries. Your Archive becomes a vast repository of lived experiences—joy and sorrow, triumph and tragedy, love and loss.\n\nYou develop an economy around memory. Rare memories—first kisses, final goodbyes, moments of transcendence—command high prices. Common memories are currency. Traumatic memories are debt.\n\nÉmile warns you: \"You're commodifying human experience. Turning the intimate into transaction.\"\n\n\"I'm giving people choice,\" you counter. \"The ability to curate their own consciousness. Isn't that freedom?\"\n\nYou've become wealthy beyond measure, not in gold but in experience. You've lived ten thousand lives through traded memories. You are everyone and no one.\n\nThe Memory Merchant—the one who trades in the currency of consciousness itself.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Memory Merchant**\n*You established an economy of memory, trading experiences across timelines and building vast wealth in lived consciousness.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_bridge_builder",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_bridge_builder",
      "endingTitle": "The Bridge Builder",
      "text": "You realize the division between Writers and Painters is artificial—a wound in reality itself. You decide to heal it.\n\nYou begin building bridges. Not metaphorical ones, but actual structures that connect the Scribes' Archive to the Paintress's Gallery. Pathways where Writers can learn painting, where Painters can study writing.\n\nThe resistance is immediate. \"We're separate for a reason,\" the elder Scribes argue. \"Mixing our traditions dilutes both.\"\n\nBut you persist. You create exchange programs. Writers spend time in painted reality, learning to see possibilities beyond singular truth. Painters study in the Archive, learning to ground imagination in documented fact.\n\nSlowly, the divide weakens. Hybrid practitioners emerge—artist-archivists who paint truths, writer-creators who document possibilities. The false dichotomy crumbles.\n\nEven the Paintress and the Head Scribe meet, for the first time in centuries, on one of your bridges. They speak. They argue. They laugh. They begin collaborating.\n\nYou've created something unprecedented: a unified Order where writing and painting, truth and possibility, memory and imagination exist in productive tension rather than hostile separation.\n\nYou become the Bridge Builder—the one who healed reality's greatest schism. Your bridges become legendary, symbols of connection, paths between worlds.\n\nÉmile tells you that you've changed the fundamental nature of existence. You've proven that division is choice, not destiny.\n\n**Chapter 1: Complete**\n**Ending Unlocked: The Bridge Builder**\n*You built permanent bridges between Writers and Painters, healing the ancient schism and creating a unified Order where both traditions flourish together.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_truth_eater",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_truth_eater",
      "endingTitle": "Truth Eater",
      "text": "You develop a unique ability: you can consume contradictory truths and digest them into singular clarity.\n\nIt starts when you're overwhelmed by the fractures. Too many timelines, too many truths, all conflicting. In desperation, you do something unprecedented—you eat the contradictions.\n\nNot metaphorically. You consume the written contradictions, swallow the paradoxes, digest the impossibilities. Your body processes them, breaks them down, extracts the essential truth beneath all variations.\n\nThe effect is immediate. Where there were seventeen different accounts of Expedition 13, you reduce them to one unified narrative. Not by choosing which version is correct, but by consuming all versions and distilling their common essence.\n\nSekers across timelines bring you their contradictions. \"I died in three timelines and lived in seven. Which is true?\"\n\nYou eat all ten possibilities. You digest them. You produce clarity: \"You exist. That's the only truth that matters across all variations.\"\n\nYou become the Truth Eater—the one who devours complexity and excretes simplicity. The Scribes call you heretic for destroying multiplicity. The Painters call you tyrant for reducing possibility to singularity.\n\nBut those caught in confusion call you savior.\n\nYour body changes. You're bloated with consumed truths, pregnant with digested realities. But from your consumption comes clarity that helps thousands find peace in fractured existence.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Truth Eater**\n*You gained power to consume contradictory truths and digest them into singular clarity, helping others find peace by simplifying complexity.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_chrono_cartographer",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_chrono_cartographer",
      "endingTitle": "Chrono Cartographer",
      "text": "You realize your maps of fractures are incomplete. They show space—the locations where timelines split—but not time itself. You decide to map the fourth dimension.\n\nYou develop new notation. New symbols. New ways of representing temporal flow across fractured realities. Your maps become four-dimensional, showing not just where fractures exist but when they occur, how they evolve, where they'll emerge next.\n\nYour charts predict future fractures. You can see weak points in reality where new splits will occur. You can trace past fractures back to their origin points with perfect accuracy.\n\nÉmile watches you work with growing concern. \"You're not just mapping time. You're starting to control it.\"\n\nHe's right. With perfect temporal maps, you can influence when fractures occur. You can strengthen certain timelines and weaken others. You're not just documenting time—you're shaping it.\n\nYou become the Chrono Cartographer—the one who charts and controls temporal flow. Your maps are prophecy and instruction. They show what will be and, increasingly, what you want to be.\n\nOther cartographers seek you out to learn your techniques. But you keep the deepest secrets to yourself. The ability to map time is the ability to control it. And that power must be carefully guarded.\n\nYou are the master of the fourth dimension, the architect of temporal geography, the one who makes time visible and, therefore, malleable.\n\n**Chapter 1: Complete**\n**Ending Unlocked: Chrono Cartographer**\n*You learned to map not just space but time itself, gaining power to chart and influence temporal flow across all fractured realities.*",
      "choices": []
    },
    {
      "id": "maelle_ch1_ending_self_authored",
      "route": "maelle",
      "chapter": 1,
      "isEnding": true,
      "endingKey": "maelle_self_authored",
      "endingTitle": "The Self-Authored",
      "text": "You have a revelation: if Writers can document reality, why can't you write yourself into every timeline?\n\nYou begin the work. In each fracture you discover, you write: \"Maelle exists here. She has always existed here. She is integral to this timeline's function.\"\n\nReality accepts your edits. Suddenly you're not just in your original timeline—you exist in all of them simultaneously, fully present, fully conscious in each.\n\nUnlike the Infinite Scribe who fractured into separate versions, you remain unified. One consciousness experiencing countless timelines at once. You are truly omnipresent.\n\nÉmile asks how you maintain your sanity. \"How do you process existing everywhere?\"\n\n\"I don't process it linearly. I exist as a narrative network. Each timeline is a chapter. I'm the book that contains them all.\"\n\nYou've become the Self-Authored—the being who wrote herself into all possible realities. You exist as a constant across fractures, an anchor point, a guaranteed element in every timeline.\n\nThe Paintress can create new fractures, but she can't create one without you. You've written yourself into the fundamental code of reality.\n\nSekers recognize you instantly in every timeline they visit. \"Oh, there's Maelle. She's always here.\" You've become as universal as gravity, as present as time itself.\n\nYou are the omnipresent narrator, the self-authored constant, the being who wrote herself into eternal, universal existence.\n\n**Chapter 1: Complete**\n**Ending Unlocked: The Self-Authored**\n*You wrote yourself into every timeline simultaneously, becoming omnipresent across all fractured realities while maintaining singular consciousness.*",
      "choices": []
    }
  ]
}
